Tekla.Structures.Drawing.Tools.DrawingCoordinateConverter
The DrawingCoordinateConverter class is used to move coordinates from one view to
another. This tool takes into account the empty areas in the views.
In the following example a similar polygon is drawn to a view and to a sheet:
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.Tools;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler DrawingHandler = new DrawingHandler();
ViewBase sheet = DrawingHandler.GetActiveDrawing().GetSheet();
DrawingObjectEnumerator Views = sheet.GetAllObjects(typeof(View));
Views.MoveNext();
View myView = Views.Current as View;
PointList PointsInView = new PointList();
PointsInView.Add(new Point(0, 0));
PointsInView.Add(new Point(100, 0));
PointsInView.Add(new Point(100, 100));
Polygon polygonInView = new Polygon(myView, PointsInView);
polygonInView.Insert();
PointList PointsInSheet = DrawingCoordinateConverter.Convert(myView, sheet, PointsInView);
Polygon polygon = new Polygon(sheet, PointsInSheet);
polygon.Insert();
}
}

Tekla.Structures.Drawing.Tools.DrawingCoordinateConverter.Convert(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point)
Converts one coordinate point from one view's coordinate system to another view's coordinate system.
fromView: The source view.
toView: The target view.
point: The point to be converted.
Returns: The converted point.

Tekla.Structures.Drawing.Tools.DrawingCoordinateConverter.Convert(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Converts a list of coordinate points from one view's coordinate system to another view's coordinate system.
fromView: The source view.
toView: The target view.
pointList: The list of points to be converted.
Returns: The converted list of points.